src/Documents/ИнвентаризацияТоваров/ИнвентаризацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияТоваров</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОпераций</name>
      <type>
        <types>EnumRef.ВидыОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОпераций</name>
    <type>
      <types>EnumRef.ВидыОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ИнвентаризацияТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти 			= Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдИзм		= РаботаСоСправочниками.УстановкаЕдИзм(СтрокаТабличнойЧасти.Номенклатура);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	      Объект.Склад = Справочники.Склады.Основной;
	      Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	 КонецЕсли;	  
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти 		= Элементы.Товары.ТекущиеДанные;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти 		= Элементы.Товары.ТекущиеДанные;

КонецПроцедуры

&НаКлиенте
Процедура НоваяСтрока(Команда)
	СтрокаТабличнойЧасти 		= Элементы.Товары.ТекущиеДанные;
КонецПроцедуры

Функция ОстатокНаСкладе (Номенклатура, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Склад,
		|	ОстаткиТоваровОстатки.Номенклатура,
		|	ОстаткиТоваровОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&Дата) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.Склад = &Склад
		|	И ОстаткиТоваровОстатки.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Если Объект.Дата = НачалоДня(ТекущаяДата()) И ПустаяСтрока(Объект.Номер) Тогда
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Иначе
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
	КонецЕсли;


   	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
         ОстатокНоменклатуры = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстатокНоменклатуры = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
	
	  //+ просчитываем резерв 160113

	РезервОснования = 0;
	Если  Объект.Заказ.Ссылка <> Документы.СчетФактура.ПустаяСсылка() тогда
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервТоваровОстатки.количествоОстаток,
		|	РезервТоваровОстатки.Номенклатура,
		|	РезервТоваровОстатки.ДокументОснование
		|ИЗ
		|	РегистрНакопления.РезервТоваров.Остатки(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад
		|				И ДокументОснование = &ДокументОснование) КАК РезервТоваровОстатки";
		
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Заказ.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Если Объект.Дата = НачалоДня(ТекущаяДата()) И ПустаяСтрока(Объект.Номер) Тогда
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Иначе
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
	КонецЕсли;


	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезервОснования = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;

КонецЕсли;
  Резерв = 0;
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервТоваровОстатки.количествоОстаток,
		|	РезервТоваровОстатки.Номенклатура,
		|	РезервТоваровОстатки.ДокументОснование
		|ИЗ
		|	РегистрНакопления.РезервТоваров.Остатки(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад) КАК РезервТоваровОстатки";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Если Объект.Дата = НачалоДня(ТекущаяДата()) И ПустаяСтрока(Объект.Номер) Тогда
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Иначе
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
	КонецЕсли;


	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Резерв = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
	
	Если резерв < 0 Тогда
		резерв = 0;
	КонецЕсли;
	Если РезервОснования < 0 Тогда 
		РезервОснования =0; 
	КонецЕсли;
	
	ВсегоРезерв = Резерв - резервОснования;
	
	ОстатокНоменклатуры = ОстатокНоменклатуры - ВсегоРезерв;
    //- просчитываем резерв 160113
	
	
	Возврат   ОстатокНоменклатуры;
КонецФункции

 &НаСервере
 Функция РольПользователя(Роль)
	 
	 Возврат	РольДоступна(Роль);
	 
 КонецФункции
 
&НаКлиенте
 Процедура ТоварыПослеУдаления(Элемент)
 КонецПроцедуры

// отрабатываем подбор
&НаКлиенте
 Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура ("ЗакрыватьПриВыборе", Истина);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Товары);
 КонецПроцедуры
           // отрабатываем подбор
&НаКлиенте
 Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Сч 		=  проверкаНаличия(ВыбранноеЗначение);
	 
	 Если Сч = 0 Тогда
		 Элементы.Товары.ДобавитьСтроку();
		 Элементы.Товары.ТекущиеДанные.Номенклатура = ВыбранноеЗначение;
		 ЗаполнитьДанные(Элементы.Товары.ТекущиеДанные.Номенклатура, Элементы.Товары.ТекущиеДанные.НомерСтроки);
	 КонецЕсли
 КонецПроцедуры
         // отрабатываем подбор
 &НаСервере
Функция проверкаНаличия(ВыбранноеЗначение)	
			Сч = 0;
	 Для каждого Строч Из Объект.Товары Цикл
		 Если Строч.Номенклатура 	= ВыбранноеЗначение тогда
			 Строч.Количество 		= Строч.Количество + 1;// Если товар уже есть - то просто приплюсуем его;

			 Сч = 1;
		 КонецЕсли;
	 КонецЦикла;
	 Возврат Сч;
КонецФункции	
         // отрабатываем подбор
&НаСервере
Процедура  ЗаполнитьДанные(товар, строка)
		
		Для каждого строч из Объект.Товары Цикл
			Если Строч.НомерСтроки = Строка Тогда
				
				Строч.ЕдИзм				= Товар.ЕдИзм;
				Строч.Количество		= 1;
								
			КонецЕсли;
			
		КонецЦикла;
		
	КонецПроцедуры
	
&НаКлиенте
Процедура Заполнить(Команда)
	   ЗаполнитьНасервере();
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ОстаткиТоваровОстатки.КоличествоОстаток) КАК КоличествоУчет,
		|	ОстаткиТоваровОстатки.Номенклатура.ЕдИзм КАК ЕдИзм
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&Период, Склад = &Склад) КАК ОстаткиТоваровОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваровОстатки.Номенклатура,
		|	ОстаткиТоваровОстатки.Номенклатура.ЕдИзм
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";

	Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Склад", Объект.Склад);

	тов =  Запрос.Выполнить().Выгрузить();
    Объект.Товары.Загрузить(тов); 
	
   КонецПроцедуры
